<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

/**
 * php think build 自动生成应用的目录结构的定义示例
 */
return [
    // 需要自动创建的文件
    '__file__' => [],
    // 需要自动创建的目录
    '__dir__' => [
        'controller',               //控制器（只处理请求）
        'api',                      //第三方接口调用相关（对外开放的接口）
        'model',                    //模型层（参数定义逻辑）
        'logic',                    //逻辑层（逻辑处理）
        'service',                  //服务层（服务定制相关）
        'cache',                    //缓存层（数据缓存定义）
        'queue',                    //队列（异步队列）
        'event',                    //事件（事件定义）
        'command',                  //命令行（系统命令定义）
        'validate',                 //数据验证（请求数据验证）
        'library',                  //拓展类（包含：控制器接口（抽象接口）、特征类（复用类）、工厂类（数据制造中心）、仓库（接口仓库））
    ],
    // 需要自动创建的控制器
    'controller' => ['Index'],
    // 需要自动创建的模型
    'model' => ['userModel'],
];
